# RemoveColumnAttachment Method (FamilyInstance, Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..RemoveColumnAttachment Method (FamilyInstance, Int32)
ColumnAttachment Class See Also
---
Removes an attachment at the top or base of a column, if there is one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static void RemoveColumnAttachment(
	FamilyInstance column,
	int baseOrTop
)
```

Visual Basic
---
```text
Public Shared Sub RemoveColumnAttachment ( _
	column As FamilyInstance, _
	baseOrTop As Integer _
)
```

Visual C++
---
```text
public:
static void RemoveColumnAttachment(
	FamilyInstance^ column,
	int baseOrTop
)
```

# ### Parameters
column
    Type: Autodesk.Revit.DB..::..FamilyInstance A column.
baseOrTop
    Type: System..::..Int32 0 for base, 1 for top.
# Remarks
This method modifies both column and target elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | baseOrTop must be either 0 or 1. |

# See Also
ColumnAttachment Class
RemoveColumnAttachment Overload
Autodesk.Revit.DB Namespace